Repository: Mohamed03-T/MedRemind
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Medication Reminder
ar: تذكير الدواء

source: Settings
ar: الإعدادات

source: Appearance
ar: المظهر

source: Dark Mode
ar: الوضع الداكن

source: Notifications
ar: التنبيهات

source: Enable Notifications
ar: تشغيل التنبيهات

source: Sound Effects
ar: المؤثرات الصوتية

source: Account
ar: الحساب

source: User Name
ar: اسم المستخدم

source: Not set
ar: لم يتم التحديد

source: More
ar: المزيد

source: About App
ar: عن التطبيق

# version
source: Version 1.0.0
ar: إصدار 1.0.0

source: Language
ar: اللغة

source: Home
ar: الرئيسية

source: Calendar
ar: التقويم

source: Medications
ar: الأدوية

source: Add Medication
ar: إضافة دواء

# noMedications
source: No medications added yet
ar: لا توجد أدوية مضافة حالياً

source: View Details
ar: عرض التفاصيل

source: Update Stock
ar: تحديث المخزون

source: Delete Medication
ar: حذف الدواء

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Edit Name
ar: تعديل الاسم

# enterName
source: Enter your name here
ar: أدخل اسمك هنا

source: Total
ar: الإجمالي

source: Taken
ar: أخذت

source: Remaining
ar: متبقية

# nextDose
source: Next Dose: {name}
ar: الجرعة القادمة: {name}

source: at {time}
ar: في تمام الساعة {time}

# enterMedName
source: Please enter medication name
ar: يرجى إدخال اسم الدواء

# stepBasicInfo
source: Basic Info & Stock
ar: المعلومات الأساسية والمخزون

# stepSchedule
source: Schedule
ar: الجدول الزمني

# stepNotification
source: Notifications
ar: التنبيهات

source: Default Sound
ar: النغمة الافتراضية

source: Soft Bell
ar: تنبيه هادئ

source: Loud Alarm
ar: تنبيه قوي

source: Glass Ping
ar: رنين زجاجي

source: Echo Chime
ar: صدى الجرس

source: Crystal Bell
ar: جرس كريستال

# snoozeTitle
source: ⏰ Snooze: Medication Time
ar: ⏰ غفوة: موعد دواء

# snoozeBody
source: Reminder after 10 minutes to take medication
ar: تذكير بعد 10 دقائق لتناول الدواء

# notificationDescription
source: Medication reminder notifications with {name} sound
ar: إشعارات تذكير الدواء بنغمة {name}

# testNotificationTitle
source: Instant Notification
ar: إشعار فوري

# testNotificationBody
source: System is working successfully! Do you hear the alert?
ar: النظام يعمل بنجاح! هل تسمع التنبيه؟

# localeDeleteQuery
source: Are you sure you want to delete {name}?
ar: هل أنت متأكد من حذف {name}؟

source: Today
ar: اليوم

source: Under Development
ar: قيد التطوير

# appSlogan
source: Your health companion for organizing daily doses
ar: رفيقك الصحي لتنظيم جرعاتك اليومية

# feature1Title
source: Smart Alerts
ar: تنبيهات ذكية

# feature1Desc
source: Never miss a dose with an advanced alert system and precise countdown.
ar: لا تنسى جرعتك أبداً مع نظام التنبيهات المتقدم والعد التنازلي الدقيق.

# feature2Title
source: Follow-up Log
ar: سجل المتابعة

# feature2Desc
source: Track your commitment through a detailed calendar showing taken doses.
ar: تتبع مدى التزامك من خلال تقويم تفصيلي يعرض الجرعات التي تم أخذها.

# feature3Title
source: Full Privacy
ar: خصوصية تامة

# feature3Desc
source: Your health data is stored locally on your device for maximum security and privacy.
ar: بياناتك الصحية مخزنة محلياً على جهازك لضمان أعلى مستويات الأمان والخصوصية.

# developedWithLove
source: Developed with love to help you maintain your health.
ar: تم التطوير بكل حب لمساعدتكم في الحفاظ على صحتكم.

source: Step 1
ar: المرحلة الأولى

source: Medication Basic Info
ar: معلومات الدواء الأساسية

source: Medication Name
ar: اسم الدواء

# medicationNameHint
source: e.g., Augmentin 1g
ar: مثلاً: أوغمنتين 1جم

# medicationForm
source: What is the medication form?
ar: ما هو شكل الدواء؟

source: Pill
ar: حبوب

source: Liquid
ar: سائل

source: Injection
ar: حقنة

source: Other
ar: آخر

# dosageAndStock
source: Dosage and Available Stock
ar: الجرعة والمخزون المتاح

source: Dose Amount
ar: كمية الجرعة الواحدة

# pillUnit
source: Pill
ar: حبة

source: ml
ar: مل

source: Previous
ar: السابق

# continueText
source: Continue
ar: المتابعة

source: Save Medication
ar: حفظ الدواء

source: Unit
ar: وحدة

# stockAmount
source: Current Stock Amount
ar: الكمية المتاحة في المخزون

source: Low Stock Alert
ar: تنبيه عند انخفاض المخزون

# lowStockLimit
source: Alert me when stock reaches
ar: نبهني عندما تتبقى كمية

source: Step 2
ar: المرحلة الثانية

# medicationSchedule
source: Schedule
ar: الجدول الزمني

# dailyFrequency
source: How many times a day?
ar: كم مرة في اليوم؟

source: times
ar: مرات

# frequencyOnce
source: Once
ar: مرة واحدة

# frequencyTwice
source: Twice
ar: مرتين

# frequencyThrice
source: 3 times
ar: 3 مرات

# frequencyFour
source: 4 times
ar: 4 مرات

# frequencyFive
source: 5 times
ar: 5 مرات

# selectTimeForDose
source: Select time for dose {number}
ar: حدد وقت الجرعة {number}

source: Step 3
ar: المرحلة الثالثة

source: Notification Settings
ar: إعدادات التنبيهات

source: Notification Sound
ar: نغمة التنبيه

source: Test Sound
ar: تجربة الصوت

source: Vibration
ar: الاهتزاز

# reorderAlert
source: Stock Alert
ar: تنبيه المخزون

source: Container Type
ar: نوع الحاوية

source: Box
ar: علبة

source: Bottle
ar: قارورة

source: Total Boxes
ar: إجمالي العلب

source: Total Bottles
ar: إجمالي القوارير

source: Units per Box
ar: عدد الحبوب في كل علبة

# unitsPerBottle
source: Liquid per Bottle
ar: إجمالي السائل في القارورة

# doseDate
source: Medication Start Date
ar: تاريخ بدء الدواء

source: First Dose Time
ar: وقت أول جرعة في اليوم

# howManyBoxes
source: How many boxes did you buy?
ar: كم علبة اشتريت؟

# howManyBottles
source: How many bottles did you buy?
ar: كم قارورة اشتريت؟

source: Taken Date
ar: تاريخ الجرعة

# currentStockLabel
source: Current Stock:
ar: المخزون الحالي:

# addedAmountLabel
source: Added Amount:
ar: الكمية المضافة:

# newStockLabel
source: New Stock:
ar: المخزون الجديد:

source: Save Update
ar: حفظ التحديث

# stockUpdateSuccess
source: ✅ Stock updated successfully: {count} {unit}
ar: ✅ تم تحديث المخزون بنجاح: {count} {unit}

# howManyUnitsPerBox
source: Units per box
ar: عدد الحبوب في العلبة

# howManyUnitsPerBottle
source: Liquid per bottle
ar: إجمالي السائل في القارورة

source: Dosing Schedule
ar: نظام تكرار الجرعات

source: Daily (Every day)
ar: يومي (كل يوم)

# everyInterval
source: Interval (Every hours)
ar: كل وقت معين

source: Every
ar: كل

source: Hour
ar: ساعة

source: Hours
ar: ساعات

source: Minute
ar: دقيقة

source: Day
ar: يوم

# setEndDate
source: Set End Date Manually
ar: تحديد تاريخ انتهاء يدوياً

# endDateDesc
source: Alerts will automatically stop on this date
ar: سيتم إيقاف التنبيهات تلقائياً في هذا التاريخ

source: Stop Date
ar: تاريخ التوقف

source: Last Step
ar: المرحلة الأخيرة

# customizeSound
source: Customize Alert Sound
ar: تخصيص صوت التنبيه

source: Sound selected
ar: تم اختيار النغمة

source: Tap to preview
ar: اضغط للمعاينة

# confirmMedication
source: Confirm Medication Info
ar: تأكيد معلومات الدواء

# readyToSave
source: Are you ready to save and activate alerts?
ar: هل أنت مستعد لحفظ الدواء وتفعيل التنبيهات؟

# readyStep
source: All set!
ar: جاهز تماماً!

# readyStepDesc
source: The app will remind you at the specified times. Remember that adhering to your medication schedule is your path to recovery.
ar: سيقوم التطبيق بتنبيهك في الأوقات المحددة بدقة. تذكر دائماً أن الالتزام بموعد الدواء هو طريقك للشفاء.

# trackHealth
source: Track your health accurately
ar: تتبع صحتك بدقة

source: Medication Details
ar: تفاصيل الدواء

source: Dosage
ar: الجرعة

source: Daily
ar: يومياً

source: Weekly
ar: أسبوعياً

# doseLogged
source: Dose logged successfully
ar: تم تسجيل أخذ الجرعة بنجاح

source: Log Dose Now
ar: تسجيل أخذ الجرعة الآن

source: Minutes
ar: دقائق

source: Days
ar: أيام

# noTasks
source: No tasks for this day
ar: لا يوجد مهام لهذا اليوم

source: Confirm
ar: تأكيد

# notTimeYetQuery
source: It is not time for this dose yet. Do you want to log it anyway?
ar: لم يحن وقت هذه الجرعة بعد. هل تريد شطبها على أي حال؟

source: Log
ar: شطب

source: Remaining Doses Today
ar: الجرعات المتبقية لليوم

# takenDosesToday
source: Taken Doses
ar: الجرعات التي تم أخذها

# noDosesToday
source: No scheduled doses for today
ar: لا توجد جرعات مجدولة لليوم
